
// An array of content
const content = [
  
  {
      "id" : 1 , 
      "hreft" : "" , 
      "category" : " new mobail" , 
      "title" : "  به‌روزرسانی بزرگ ماه ژوئن سری گلکسی S23 منتشر شد" ,
      "discription" : " سامسونگ به‌روزرسانی بزرگ ماه ژوئن را برای گوشی‌های هوشمند خانواده‌ی گلکسی S23 منتشر کرد و اکنون کاربران اروپایی می‌توانند آن را دانلود کنند.        " , 
      "time" : " 12:25 " ,
      "img" : "/images/m2-c4.webp " ,
      "coment" : ""
      

  } , 

  {
      "id" : 2 ,
      "hreft" : "" ,  
      "category" : " new mobail" , 
      "title" : "این نخستین تصویر باکیفیت از گلکسی زد فولد 5 است! " ,
      "discription" : "جدیدترین تصویر فاش‌شده نشان می‌دهند که سامسونگ فعلاً تصمیمی برای ایجاد تغییر گلکسی زد فولد 5 ندارد. " , 
      "time" : "" ,
      "img" : "/images/m2-c2.webp "
              
  } , 

  {
      "id" : 3 ,
      "hreft" : "" , 
      "category" : " new mobail hard" , 
      "title" : " مشکل در نمایشگر گلکسی S21 اولترا پس از دریافت به‌روزرسانی" ,
      "discription" : "به گزارش برخی از کاربران در شبکه‌های اجتماعی، نمایشگر گوشی گلکسی S21 اولترا، پس از به‌روزرسانی با مشکل نمایش خط صورتی مواجه شده است. " , 
      "time" : " " ,
      "img" : "/images/m2-c1.webp"
              
  } ,
  
  {
      "id" : 4  ,
      "hreft" : " " , 
      "category" : " new hard" , 
      "title" : "بررسی پوکو F5؛ گیمرپسند اقتصادی " ,
      "discription" : " آیا قدرت سخت‌افزاری و نمایشگر باکیفیت دلایل کافی برای خرید یک گوشی هوشمند خواهند بود؟ با بررسی پوکو F5 همراه زومیت باشید." , 
      "time" : " " ,
      "img" : "/images/m2-c3.webp"
              
  } ,
  
  {
      "id" : 5 ,
      "hreft" : " " , 
      "category" : " new mobail" , 
      "title" : "به‌روزرسانی بزرگ ماه ژوئن سری گلکسی S23 منتشر شد " ,
      "discription" : " سامسونگ به‌روزرسانی بزرگ ماه ژوئن را برای گوشی‌های هوشمند خانواده‌ی گلکسی S23 منتشر کرد و اکنون کاربران اروپایی می‌توانند آن را دانلود کنند. " , 
      "time" : " " ,
      "img" : "/images/m2-c4.webp"
              
  } ,
  
  {
      "id" : 6 ,
      "hreft" : " " , 
      "category" : " new" , 
      "title" : "آیفون‌های بعدی اپل ممکن است در‌برابر خراشیدگی و ضربه مقاوم باشند " ,
      "discription" : "  در‌صورت عملی‌شدن پتنت جدید اپل، یکی از نگرانی‌های اصلی کاربران آیفون رفع خواهد شد.  " , 
      "time" : " " ,
      "img" : "/images/m2-c6.webp"
              
  } ,
    
  {
      "id" : 8 ,
      "hreft" : " " , 
      "category" : " new" , 
      "title" : "بومی‌سازی در حوزه فناوری؛ گوشی و سیستم عامل ایرانی در دست ساخت است " ,
      "discription" : "  گوشی تلفن همراه ایرانی و سیستم عامل بومی پروژه‌های تولیدی جدیدی هستند که وزارت ارتباطات و وزارت صمت در دستور کار خود قرار داده‌اند. " , 
      "time" : " " ,
      "img" : "/images/m2-c7.webp"
              
  } ,
  
  {
      "id" : 9 ,
      "hreft" : " " , 
      "category" : " new mobail" , 
      "title" : " پس از افشای تصاویر گلکسی زد فولد ۵، این‌ بار نوبت به گلکسی زد فلیپ ۵ رسید!" ,
      "discription" : " تنها چند ساعت پس از فاش‌شدن نخستین تصاویر گلکسی Z Fold 5 اکنون نوبت به لو رفتن عکس‌های Z Flip 5 رسیده است." , 
      "time" : " " ,
      "img" : "/images/m2-c8.webp"
              
  } ,
  
  {
      "id" : 10 ,
      "hreft" : " " , 
      "category" : " new" , 
      "title" : "گزارش سرف‌شارک از شاخص‌های کیفیت زندگی دیجیتال: جایگاه نگران‌کننده ایران در امنیت سایبری " ,
      "discription" : "  وب سایت سرف شارک شاخص‌های کیفیت زندگی دیجیتال در سال ۲۰۲۲ را منتشر کرده که بر اساس آن ایران از بین ۱۱۷ کشور، رتبه ۸۴ را دارد. " , 
      "time" : " " ,
      "img" : "/images/m2-c9.webp"
              
  } ,
  
  {
      "id" : 11 ,
      "hreft" : " " , 
      "category" : " new" , 
      "title" : "مک پرو اپل، از راه نرسیده دردسرساز شد! " ,
      "discription" : " اپل در مک پرو ۲۰۲۳ ارتقای حافظه‌ی ذخیره‌سازی را امکان‌پذیر کرده است، اما این کامپیوتر با برخی از درایوهای SATA مشکل دارد. " , 
      "time" : " " ,
      "img" : "/images/m2-c10.webp"
              
  } ,
  
  {
      "id" : 12 ,
      "hreft" : " " , 
      "category" : " new mobail" , 
      "title" : " وضعیت سرعت اینترنت در ماه می به روایت اسپیدتست " ,
      "discription" : " در ماه می جایگاه کشور در میانه سرعت اینترنت موبایل و ثابت اندکی پایین‌تر از ماه آپریل بود.  " , 
      "time" : " " ,
      "img" : "/images/m2-c11.webp"
              
  } ,
  
  {
      "id" : 13 ,
      "hreft" : " " , 
      "category" : " new" , 
      "title" : "این حلقه هوشمند خوش‌قیمت روی سلامتی، ورزش و خواب نظارت می‌کند " ,
      "discription" : " حلقه‌ی هوشمند Rollme R3 با قابلیت‌های جذاب ازجمله پایش ضربان قلب و اکسیژن خون معرفی شد. " , 
      "time" : " " ,
      "img" : "/images/m2-c12.webp"
              
  } ,
  
  {
      "id" : 14 ,
      "hreft" : " " , 
      "category" : " new" , 
      "title" : " تراشه‌ساز محبوب، TSMC، به مرده یا زنده‌بودن قانون مور اهمیتی نمی‌دهد" ,
      "discription" : " براساس گفته‌های معاون ارشد شرکت TSMC، قانون مور دیگر برای آن‌ها مهم نیست و روش‌های جدیدی برای بهبود عملکرد تراشه‌ها وجود دارد. " , 
      "time" : " " ,
      "img" : "/images/m2-c13.webp"
              
  } ,
  
  {
      "id" : 15 ,
      "hreft" : " " , 
      "category" : " new" , 
      "title" : " هواوی: واچ فیت ۳ از اپل واچ SE ارزش خرید بیشتری دارد " ,
      "discription" : "واچ فیت ۳ طراحی مشابه و قیمت کمتری از اپل واچ SE دارد و هواوی آن را از ساعت هوشمند اپل هم برتر می‌داند. " , 
      "time" : " " ,
      "img" : "/images/m2-c14.webp"
              
  } ,
  
  {
      "id" : 16 ,
      "hreft" : " " , 
      "category" : " new" , 
      "title" : " جیپ کامپس ۲۰۲۵ معرفی شد؛ همان مدل ۲۰۲۴ با تغییرات بسیار اندک" ,
      "discription" : "جیپ کامپس ۲۰۲۵ با تغییرات اندک و قیمت ثابت درمقایسه‌با مدل ۲۰۲۴ معرفی شد. " , 
      "time" : " " ,
      "img" : "/images/m2-c15.webp"
              
  } ,
  
  {
      "id" : 17 ,
      "hreft" : " " , 
      "category" : " new" , 
      "title" : " دانشمندان قسمت مسئول کنجکاوی در مغز را شناسایی کردند" ,
      "discription" : "دانشمندان با کشف ناحیه‌ای از مغز که با کنجکاوی ارتباط دارد، می‌توانند بیماری‌هایی را که در آن حس کنجکاوی از بین می‌رود، مانند افسردگی مزمن درمان ... " , 
      "time" : " " ,
      "img" : "/images/m2-c16.webp"
              
  } ,
  
  {
      "id" : 18 ,
      "hreft" : " " , 
      "category" : " new" , 
      "title" : " فوری: هوش مصنوعی اپل با بتای iOS 18.1 دردسترس توسعه‌دهندگان قرار گرفت " ,
      "discription" : " با انتشار بتای iOS 18.1 و iPadOS 18.1 و macOS Sequoia 15.1، هوش مصنوعی اپل دردسترس توسعه‌دهندگان قرار گرفت." , 
      "time" : " " ,
      "img" : "/images/m2-c17.webp"
              
  } ,
  
  {
      "id" : 19 ,
      "hreft" : " " , 
      "category" : " new mobail" , 
      "title" : "آموزش حل مشکل لاگین اکانت پلی استیشن روی پی سی و موبایل " ,
      "discription" : "اگر شما هم برای ورود به اکانت پلی استیشن روی کامپیوتر و موبایل به مشکل خورده‌اید، این مقاله را از دست ندهید. " , 
      "time" : " " ,
      "img" : "/images/m2-c18.webp"
              
  } ,
  
  {
      "id" : 20 ,
      "hreft" : " " , 
      "category" : " new mobail hard" , 
      "title" : "وان‌پلاس نمایشگر برخی از گوشی‌های قدیمی را رایگان عوض می‌کند " ,
      "discription" : " وان‌پلاس برای جلوگیری از خطای سخت‌افزاری که پیش‌تر در گوشی‌های سامسونگ نیز مشاهده شده،‌ طرح تعویض رایگان نمایشگر را راه‌اندازی کرده است." , 
      "time" : " " ,
      "img" : "/images/m2-c19.webp"
              
  } ,
  {
    "id" : 9 ,
    "hreft" : " " , 
    "category" : " new mobail" , 
    "title" : " پس از افشای تصاویر گلکسی زد فولد ۵، این‌ بار نوبت به گلکسی زد فلیپ ۵ رسید!" ,
    "discription" : " تنها چند ساعت پس از فاش‌شدن نخستین تصاویر گلکسی Z Fold 5 اکنون نوبت به لو رفتن عکس‌های Z Flip 5 رسیده است." , 
    "time" : " " ,
    "img" : "/images/m2-c8.webp"
            
} ,

{
    "id" : 10 ,
    "hreft" : " " , 
    "category" : " new" , 
    "title" : "گزارش سرف‌شارک از شاخص‌های کیفیت زندگی دیجیتال: جایگاه نگران‌کننده ایران در امنیت سایبری " ,
    "discription" : "  وب سایت سرف شارک شاخص‌های کیفیت زندگی دیجیتال در سال ۲۰۲۲ را منتشر کرده که بر اساس آن ایران از بین ۱۱۷ کشور، رتبه ۸۴ را دارد. " , 
    "time" : " " ,
    "img" : "/images/m2-c9.webp"
            
} ,

{
    "id" : 11 ,
    "hreft" : " " , 
    "category" : " new" , 
    "title" : "مک پرو اپل، از راه نرسیده دردسرساز شد! " ,
    "discription" : " اپل در مک پرو ۲۰۲۳ ارتقای حافظه‌ی ذخیره‌سازی را امکان‌پذیر کرده است، اما این کامپیوتر با برخی از درایوهای SATA مشکل دارد. " , 
    "time" : " " ,
    "img" : "/images/m2-c10.webp"
            
} ,

{
    "id" : 12 ,
    "hreft" : " " , 
    "category" : " new mobail" , 
    "title" : " وضعیت سرعت اینترنت در ماه می به روایت اسپیدتست " ,
    "discription" : " در ماه می جایگاه کشور در میانه سرعت اینترنت موبایل و ثابت اندکی پایین‌تر از ماه آپریل بود.  " , 
    "time" : " " ,
    "img" : "/images/m2-c11.webp"
            
} ,
{
      "id" : 9 ,
      "hreft" : " " , 
      "category" : " new" , 
      "title" : " پس از افشای تصاویر گلکسی زد فولد ۵، این‌ بار نوبت به گلکسی زد فلیپ ۵ رسید!" ,
      "discription" : " تنها چند ساعت پس از فاش‌شدن نخستین تصاویر گلکسی Z Fold 5 اکنون نوبت به لو رفتن عکس‌های Z Flip 5 رسیده است." , 
      "time" : " " ,
      "img" : "/images/m2-c8.webp"
              
  } ,
  
  {
      "id" : 10 ,
      "hreft" : " " , 
      "category" : " new" , 
      "title" : "گزارش سرف‌شارک از شاخص‌های کیفیت زندگی دیجیتال: جایگاه نگران‌کننده ایران در امنیت سایبری " ,
      "discription" : "  وب سایت سرف شارک شاخص‌های کیفیت زندگی دیجیتال در سال ۲۰۲۲ را منتشر کرده که بر اساس آن ایران از بین ۱۱۷ کشور، رتبه ۸۴ را دارد. " , 
      "time" : " " ,
      "img" : "/images/m2-c9.webp"
              
  } ,
  
  {
      "id" : 11 ,
      "hreft" : " " , 
      "category" : " new" , 
      "title" : "مک پرو اپل، از راه نرسیده دردسرساز شد! " ,
      "discription" : " اپل در مک پرو ۲۰۲۳ ارتقای حافظه‌ی ذخیره‌سازی را امکان‌پذیر کرده است، اما این کامپیوتر با برخی از درایوهای SATA مشکل دارد. " , 
      "time" : " " ,
      "img" : "/images/m2-c10.webp"
              
  } ,
  
  {
      "id" : 12 ,
      "hreft" : " " , 
      "category" : " new mobail" , 
      "title" : " وضعیت سرعت اینترنت در ماه می به روایت اسپیدتست " ,
      "discription" : " در ماه می جایگاه کشور در میانه سرعت اینترنت موبایل و ثابت اندکی پایین‌تر از ماه آپریل بود.  " , 
      "time" : " " ,
      "img" : "/images/m2-c11.webp"
              
  } ,
  
  {
    "id" : 24 ,
    "hreft" : " " , 
    "category" : " Hot" , 
    "title" : " گلکسی رینگ با گوشی‌های غیرسامسونگ هم کار می‌کند" ,
    "discription" : "گزارشی جدید نشان می‌دهد که حلقه‌ی هوشمند سامسونگ می‌تواند با گوشی‌های غیرسامسونگ نیز کار کند. " , 
    "time" : " " ,
    "img" : "/images/m2-c26.webp"
            
  } ,
  {
    "id" : 25 ,
    "hreft" : " " , 
    "category" : " Hot" , 
    "title" : " ابرخودرو جدید ریمک با طراحی کاملاً متفاوت به‌زودی از راه می‌رسد" ,
    "discription" : " ریمک چند تیزر از ابرخودرو جدیدش با طراحی کاملاً متفاوت به‌ نمایش گذاشت." , 
    "time" : " " ,
    "img" : "/images/m2-c25.webp"
            
  } ,
  
  {
    "id" : 21 ,
    "hreft" : " " , 
    "category" : " Hot" , 
    "title" : " آموزش کامل حذف اکانت تلگرام" ,
    "discription" : " دیلیت اکانت تلگرام بسیار ساده است و تنها با طی کردن چند مرحله‌ی ساده می‌توانید نسبت حذف اکانت تلگرام خود اقدام کنید." , 
    "time" : " " ,
    "img" : "/images/m2-c22.webp"
            
  } ,
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Hot" , 
    "title" : "گزارش: آیفون ۱۷ اسلیم، گامی به‌سوی آینده‌ای بهتر برای آیفون‌ها است " ,
    "discription" : "ظاهراً اپل قصد دارد با معرفی گوشی باریک و خاص آیفون ۱۷ اسلیم، جان تازه‌ای به خط تولید گوشی‌های هوشمندش بدهد. " , 
    "time" : " " ,
    "img" : "/images/m2-c222.webp"
            
  } ,
  {
    "id" : 24 ,
    "hreft" : " " , 
    "category" : " Hot" , 
    "title" : " گلکسی رینگ با گوشی‌های غیرسامسونگ هم کار می‌کند" ,
    "discription" : "گزارشی جدید نشان می‌دهد که حلقه‌ی هوشمند سامسونگ می‌تواند با گوشی‌های غیرسامسونگ نیز کار کند. " , 
    "time" : " " ,
    "img" : "/images/m2-c26.webp"
            
  } ,
  {
    "id" : 25 ,
    "hreft" : " " , 
    "category" : " Hot" , 
    "title" : " ابرخودرو جدید ریمک با طراحی کاملاً متفاوت به‌زودی از راه می‌رسد" ,
    "discription" : " ریمک چند تیزر از ابرخودرو جدیدش با طراحی کاملاً متفاوت به‌ نمایش گذاشت." , 
    "time" : " " ,
    "img" : "/images/m2-c25.webp"
            
  } ,
  
  {
    "id" : 23 ,
    "hreft" : " " , 
    "category" : " Hot" , 
    "title" : " گوشی بعدی شیائومی باتری غول‌پیکر ۷۵۰۰ میلی‌آمپرساعتی خواهد داشت" ,
    "discription" : "ظاهرا تعدادی از گوشی‌های آینده‌ی شیائومی باتری پرظرفیت ۷۵۰۰ میلی‌آمپرساعتی خواهند داشت. " , 
    "time" : " " ,
    "img" : "/images/m2-c23.webp"
            
  } ,
  {
    "id" : 24 ,
    "hreft" : " " , 
    "category" : " Hot" , 
    "title" : " گلکسی رینگ با گوشی‌های غیرسامسونگ هم کار می‌کند" ,
    "discription" : "گزارشی جدید نشان می‌دهد که حلقه‌ی هوشمند سامسونگ می‌تواند با گوشی‌های غیرسامسونگ نیز کار کند. " , 
    "time" : " " ,
    "img" : "/images/m2-c26.webp"
            
  } ,
  {
    "id" : 25 ,
    "hreft" : " " , 
    "category" : " Hot" , 
    "title" : " ابرخودرو جدید ریمک با طراحی کاملاً متفاوت به‌زودی از راه می‌رسد" ,
    "discription" : " ریمک چند تیزر از ابرخودرو جدیدش با طراحی کاملاً متفاوت به‌ نمایش گذاشت." , 
    "time" : " " ,
    "img" : "/images/m2-c25.webp"
            
  } ,
  {
    "id" : 26 ,
    "hreft" : " " , 
    "category" : " Hot" , 
    "title" : "پمپ حرارتی پیشرفته ال‌جی رونمایی شد؛ تولید آب ۷۵ درجه در محیط ۲۸ درجه زیر صفر " ,
    "discription" : " پمپ‌ حرارتی جدید ال‌جی با کمپرسور پیشرفته و مصرف انرژی پایین رونمایی شد." , 
    "time" : " " ,
    "img" : "/images/m2-c27.webp"
            
  } ,
  {
    "id" : 24 ,
    "hreft" : " " , 
    "category" : " Hot" , 
    "title" : " گلکسی رینگ با گوشی‌های غیرسامسونگ هم کار می‌کند" ,
    "discription" : "گزارشی جدید نشان می‌دهد که حلقه‌ی هوشمند سامسونگ می‌تواند با گوشی‌های غیرسامسونگ نیز کار کند. " , 
    "time" : " " ,
    "img" : "/images/m2-c26.webp"
            
  } ,
  {
    "id" : 25 ,
    "hreft" : " " , 
    "category" : " Hot" , 
    "title" : " ابرخودرو جدید ریمک با طراحی کاملاً متفاوت به‌زودی از راه می‌رسد" ,
    "discription" : " ریمک چند تیزر از ابرخودرو جدیدش با طراحی کاملاً متفاوت به‌ نمایش گذاشت." , 
    "time" : " " ,
    "img" : "/images/m2-c25.webp"
            
  } ,
  
  {
    "id" : 21 ,
    "hreft" : " " , 
    "category" : " Hot" , 
    "title" : " آموزش کامل حذف اکانت تلگرام" ,
    "discription" : " دیلیت اکانت تلگرام بسیار ساده است و تنها با طی کردن چند مرحله‌ی ساده می‌توانید نسبت حذف اکانت تلگرام خود اقدام کنید." , 
    "time" : " " ,
    "img" : "/images/m2-c22.webp"
            
  } ,
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Hot" , 
    "title" : "گزارش: آیفون ۱۷ اسلیم، گامی به‌سوی آینده‌ای بهتر برای آیفون‌ها است " ,
    "discription" : "ظاهراً اپل قصد دارد با معرفی گوشی باریک و خاص آیفون ۱۷ اسلیم، جان تازه‌ای به خط تولید گوشی‌های هوشمندش بدهد. " , 
    "time" : " " ,
    "img" : "/images/m2-c222.webp"
            
  },
  {
    "id" : 27 ,
    "hreft" : " " , 
    "category" : " Hot" , 
    "title" : "پیکسل ۹ پرو و پرو ایکس‌ال معرفی شدند؛ پرچم‌داران تمام‌عیار و چشم‌نواز گوگل در دو اندازه جدید " ,
    "discription" : " گوگل پرچم‌داران حرفه‌ای خود را با تراشه‌ی ارتقایافته، هوش مصنوعی پیشرفته‌تر و پشتیبانی نرم‌افزاری طولانی‌مدت معرفی کرد." , 
    "time" : " " ,
    "img" : "/images/m2-c27a.webp"
            
  } ,

  {
    "id" : 21 ,
    "hreft" : " " , 
    "category" : " Hot" , 
    "title" : "پیکسل ۹ پرو فولد از راه رسید؛ تاشدنی قدرتمند گوگل و رقیب جدی گلکسی زد فولد ۶ " ,
    "discription" : "گوگل گوشی تاشدنی جدید خود با نام پیکسل ۹ پرو فولد را رونمایی کرد. این گوشی یکی از جدی‌ترین رقبای گلکسی زد فولد ۶ سامسونگ است. " , 
    "time" : " " ,
    "img" : "/images/m2-c28.webp"
            
  } ,
  {
    "id" : 25 ,
    "hreft" : " " , 
    "category" : " Hot" , 
    "title" : " ابرخودرو جدید ریمک با طراحی کاملاً متفاوت به‌زودی از راه می‌رسد" ,
    "discription" : " ریمک چند تیزر از ابرخودرو جدیدش با طراحی کاملاً متفاوت به‌ نمایش گذاشت." , 
    "time" : " " ,
    "img" : "/images/m2-c25.webp"
            
  } ,
  
  {
    "id" : 21 ,
    "hreft" : " " , 
    "category" : " Hot Educate" , 
    "title" : " آموزش کامل حذف اکانت تلگرام" ,
    "discription" : " دیلیت اکانت تلگرام بسیار ساده است و تنها با طی کردن چند مرحله‌ی ساده می‌توانید نسبت حذف اکانت تلگرام خود اقدام کنید." , 
    "time" : " " ,
    "img" : "/images/m2-c22.webp"
            
  } ,
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Hot" , 
    "title" : "گزارش: آیفون ۱۷ اسلیم، گامی به‌سوی آینده‌ای بهتر برای آیفون‌ها است " ,
    "discription" : "ظاهراً اپل قصد دارد با معرفی گوشی باریک و خاص آیفون ۱۷ اسلیم، جان تازه‌ای به خط تولید گوشی‌های هوشمندش بدهد. " , 
    "time" : " " ,
    "img" : "/images/m2-c222.webp"
            
  },
  {
    "id" : 27 ,
    "hreft" : " " , 
    "category" : " Hot" , 
    "title" : "پیکسل ۹ پرو و پرو ایکس‌ال معرفی شدند؛ پرچم‌داران تمام‌عیار و چشم‌نواز گوگل در دو اندازه جدید " ,
    "discription" : " گوگل پرچم‌داران حرفه‌ای خود را با تراشه‌ی ارتقایافته، هوش مصنوعی پیشرفته‌تر و پشتیبانی نرم‌افزاری طولانی‌مدت معرفی کرد." , 
    "time" : " " ,
    "img" : "/images/m2-c27a.webp"
            
  } ,

  {
    "id" : 21 ,
    "hreft" : " " , 
    "category" : " Hot" , 
    "title" : "پیکسل ۹ پرو فولد از راه رسید؛ تاشدنی قدرتمند گوگل و رقیب جدی گلکسی زد فولد ۶ " ,
    "discription" : "گوگل گوشی تاشدنی جدید خود با نام پیکسل ۹ پرو فولد را رونمایی کرد. این گوشی یکی از جدی‌ترین رقبای گلکسی زد فولد ۶ سامسونگ است. " , 
    "time" : " " ,
    "img" : "/images/m2-c27a.webp"
            
  } ,




  {
    "id" : 21 ,
    "hreft" : " " , 
    "category" : " Iran" , 
    "title" : " بهترین بیمه شخص ثالث خودرو کدام است؟" ,
    "discription" : " در این مطلب همه‌ی ویژگی‌هایی که یک بیمه‌ی شخص ثالث مناسب باید داشته باشد توضیح داده شده تا بتوانید از طریق این راهنما بهترین بیمه را انتخاب کنید." , 
    "time" : " " ,
    "img" : "/images/m2-c21i.webp"
              
  } ,

  {
    "id" : 21 ,
    "hreft" : " " , 
    "category" : " Iran" , 
    "title" : " راهنمای خدمات پورتال سازمان رگولاتوری؛ از پیگیری وضعیت اینترنت تا شکایت درباره تشعشعات" ,
    "discription" : "وبسایت سازمان تنظیم مقررات و ارتباطات رادیویی، خدمات الکترونیک مختلفی ارئه می‌دهد؛ از درخواست مجوز برای خدمات تا پیگیری شکایت از پیامک‌های انبوه. " , 
    "time" : " " ,
    "img" : "/images/m2-c21ir.webp"
            
  } ,
  {
    "id" : 21 ,
    "hreft" : " " , 
    "category" : " Iran" , 
    "title" : " رونمایی از قابلیت امتیازدهی کاربران راننده به کاربران مسافر اسنپ" ,
    "discription" : "اسنپ با معرفی قابلیت جدید به کاربران راننده این امکان را می‌دهد که همسفران خود را در سفرهای اسنپی ارزیابی کنند و نظر بدهند. " , 
    "time" : " " ,
    "img" : "/images/m2-c211ir.webp"
            
  } ,
  {
    "id" : 21 ,
    "hreft" : " " , 
    "category" : " Iran" , 
    "title" : " شرایط دریافت ارز مسافرتی و نرخ آن در سال ۱۴۰۳" ,
    "discription" : "ارز مسافرتی چیست، شرایط دریافت آن چگونه است، میزان ارز مسافرتی چقدر است و چطور می‌توانید ارز مسافرتی بگیرید؟ در این مطلب به این سؤالات پاسخ داده‌ایم. " , 
    "time" : " " ,
    "img" : "/images/m2-c21irir.webp"
            
  } ,
  {
    "id" : 21 ,
    "hreft" : " " , 
    "category" : " Iran" , 
    "title" : " خداحافظی تپسی با سه شرکت زیرمجموعه‌اش؛ فعالیت «تپسی‌پک»، شرکت سرمایه‌گذاری و سرویس مدارس متوقف شد" ,
    "discription" : " اطلاعیه‌ی منتشرشده از سوی تپسی روی سایت کدال از به پایان خط رسیدن سه شرکت زیرمجموعه‌اش خبر می‌دهد." , 
    "time" : " " ,
    "img" : "/images/m2-c21ir-a.webp"
            
  } ,


  {
      "id" : 21 ,
      "hreft" : " " , 
      "category" : " Iran" , 
      "title" : " همراه اول برای خرید ۴۰ درصد از سهام دیجی‌کالا ۸ هزار و ۴۰۰ میلیارد تومان هزینه کرد" ,
      "discription" : "شرکت ارتباطات سیار ایران در سایت کدال اطلاعیه‌ی خرید سهام گروه تجارت الکترونیک دیجی‌کالا را منتشر کرد. " , 
      "time" : " " ,
      "img" : "/images/m2-c21b.webp"
              
  } ,
  
  {
    "id" : 21 ,
    "hreft" : " " , 
    "category" : " Iran" , 
    "title" : " بهترین بیمه شخص ثالث خودرو کدام است؟" ,
    "discription" : " در این مطلب همه‌ی ویژگی‌هایی که یک بیمه‌ی شخص ثالث مناسب باید داشته باشد توضیح داده شده تا بتوانید از طریق این راهنما بهترین بیمه را انتخاب کنید." , 
    "time" : " " ,
    "img" : "/images/m2-c21i.webp"
              
  } ,

  {
    "id" : 21 ,
    "hreft" : " " , 
    "category" : " Iran" , 
    "title" : " راهنمای خدمات پورتال سازمان رگولاتوری؛ از پیگیری وضعیت اینترنت تا شکایت درباره تشعشعات" ,
    "discription" : "وبسایت سازمان تنظیم مقررات و ارتباطات رادیویی، خدمات الکترونیک مختلفی ارئه می‌دهد؛ از درخواست مجوز برای خدمات تا پیگیری شکایت از پیامک‌های انبوه. " , 
    "time" : " " ,
    "img" : "/images/m2-c21ir.webp"
            
  } ,
  {
    "id" : 21 ,
    "hreft" : " " , 
    "category" : " Iran" , 
    "title" : " رونمایی از قابلیت امتیازدهی کاربران راننده به کاربران مسافر اسنپ" ,
    "discription" : "اسنپ با معرفی قابلیت جدید به کاربران راننده این امکان را می‌دهد که همسفران خود را در سفرهای اسنپی ارزیابی کنند و نظر بدهند. " , 
    "time" : " " ,
    "img" : "/images/m2-c211ir.webp"
            
  } ,
  {
    "id" : 21 ,
    "hreft" : " " , 
    "category" : " Iran" , 
    "title" : " شرایط دریافت ارز مسافرتی و نرخ آن در سال ۱۴۰۳" ,
    "discription" : "ارز مسافرتی چیست، شرایط دریافت آن چگونه است، میزان ارز مسافرتی چقدر است و چطور می‌توانید ارز مسافرتی بگیرید؟ در این مطلب به این سؤالات پاسخ داده‌ایم. " , 
    "time" : " " ,
    "img" : "/images/m2-c21irir.webp"
            
  } ,
  {
    "id" : 21 ,
    "hreft" : " " , 
    "category" : " Iran" , 
    "title" : " خداحافظی تپسی با سه شرکت زیرمجموعه‌اش؛ فعالیت «تپسی‌پک»، شرکت سرمایه‌گذاری و سرویس مدارس متوقف شد" ,
    "discription" : " اطلاعیه‌ی منتشرشده از سوی تپسی روی سایت کدال از به پایان خط رسیدن سه شرکت زیرمجموعه‌اش خبر می‌دهد." , 
    "time" : " " ,
    "img" : "/images/m2-c21ir-a.webp"
            
  } ,


  {
      "id" : 21 ,
      "hreft" : " " , 
      "category" : " Iran" , 
      "title" : " همراه اول برای خرید ۴۰ درصد از سهام دیجی‌کالا ۸ هزار و ۴۰۰ میلیارد تومان هزینه کرد" ,
      "discription" : "شرکت ارتباطات سیار ایران در سایت کدال اطلاعیه‌ی خرید سهام گروه تجارت الکترونیک دیجی‌کالا را منتشر کرد. " , 
      "time" : " " ,
      "img" : "/images/m2-c21b.webp"
              
  } ,
  {
    "id" : 21 ,
    "hreft" : " " , 
    "category" : " Iran shopping" , 
    "title" : " راهنمای خدمات پورتال سازمان رگولاتوری؛ از پیگیری وضعیت اینترنت تا شکایت درباره تشعشعات" ,
    "discription" : "وبسایت سازمان تنظیم مقررات و ارتباطات رادیویی، خدمات الکترونیک مختلفی ارئه می‌دهد؛ از درخواست مجوز برای خدمات تا پیگیری شکایت از پیامک‌های انبوه. " , 
    "time" : " " ,
    "img" : "/images/m2-c21ir.webp"
            
  } ,
  {
    "id" : 21 ,
    "hreft" : " " , 
    "category" : " Iran" , 
    "title" : " رونمایی از قابلیت امتیازدهی کاربران راننده به کاربران مسافر اسنپ" ,
    "discription" : "اسنپ با معرفی قابلیت جدید به کاربران راننده این امکان را می‌دهد که همسفران خود را در سفرهای اسنپی ارزیابی کنند و نظر بدهند. " , 
    "time" : " " ,
    "img" : "/images/m2-c211ir.webp"
            
  } ,
  {
    "id" : 21 ,
    "hreft" : " " , 
    "category" : " Iran" , 
    "title" : " شرایط دریافت ارز مسافرتی و نرخ آن در سال ۱۴۰۳" ,
    "discription" : "ارز مسافرتی چیست، شرایط دریافت آن چگونه است، میزان ارز مسافرتی چقدر است و چطور می‌توانید ارز مسافرتی بگیرید؟ در این مطلب به این سؤالات پاسخ داده‌ایم. " , 
    "time" : " " ,
    "img" : "/images/m2-c21irir.webp"
            
  } ,
  {
    "id" : 21 ,
    "hreft" : " " , 
    "category" : " Iran" , 
    "title" : " خداحافظی تپسی با سه شرکت زیرمجموعه‌اش؛ فعالیت «تپسی‌پک»، شرکت سرمایه‌گذاری و سرویس مدارس متوقف شد" ,
    "discription" : " اطلاعیه‌ی منتشرشده از سوی تپسی روی سایت کدال از به پایان خط رسیدن سه شرکت زیرمجموعه‌اش خبر می‌دهد." , 
    "time" : " " ,
    "img" : "/images/m2-c21ir-a.webp"
            
  } ,

  
  {
      "id" : 23 ,
      "hreft" : " " , 
      "category" : " Iran" , 
      "title" : "تپسی کسب و کار ارسال مرسوله خود را گسترش می‌دهد " ,
      "discription" : " با اضافه شدن کسب و کارهای جدید به سوپراپ تپسی و ایجاد فرصت برای توسعه سرویس ارسال مرسوله فوری، شرکت تپسی تمرکز خود را برای توسعه این بخش قرار می‌دهد." , 
      "time" : " " ,
      "img" : "/images/m2-c1.webp"
              
  } ,
  
  {
      "id" : 24 ,
      "hreft" : " " , 
      "category" : " Iran" , 
      "title" : "حسین افشین: معاونت علمی و فناوری نباید وارد منازعات سیاسی شود " ,
      "discription" : " مراسم تکریم و معارفه‌ی معاونت علمی، فناوری و اقتصاد دانش‌بنیان رئیس‌جمهور برگزار شد. " , 
      "time" : " " ,
      "img" : "/images/m2-c1.webp"
              
  },
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : "زبانی که با آن صحبت می‌کنیم، می‌تواند تشخیص رنگ‌ها را برایمان آسان‌تر کند " ,
    "discription" : "طبق مطالعه‌ای جدید، زبانی که با آن حرف می‌زنیم کمک می‌کند تا تشخیص سایه‌ها و رنگ‌های مختلف برایمان ساده‌تر شود. " , 
    "time" : " " ,
    "img" : "/images/m2-c1s.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : " چرا رایج‌ترین عناصر جهان روی زمین کمیاب هستند؟" ,
    "discription" : "عنصرهای رایج جهان مثل هیدروژن و هلیوم به سختی روی زمین پیدا می‌شوند؛ اما علت این کمیابی چیست؟ " , 
    "time" : " " ,
    "img" : "/images/m2-c2scie.webp"
              
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : " معمای تکاملی خارهای گل رز" ,
    "discription" : " خارهای گل رز، این ساختارهای به ظاهر ساده، داستان تکاملی جذابی را در خود پنهان کرده‌اند که راهبردهای مبتکرانه‌ی طبیعت برای بقا را آشکار می‌کند." , 
    "time" : " " ,
    "img" : "/images/m2-c3sc.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : " آیا واقعا می‌توان دیوار چین را از فضا مشاهده کرد؟" ,
    "discription" : " رسانه‌ها در گزارش فضانوردان مبنی بر مشاهده دیوار بزرگ چین و سازه‌های دیگر اغراق می‌کنند، اما تأثیر انسان بر سیاره زمین از فضا کاملا مشهود است." , 
    "time" : " " ,
    "img" : "/images/m2-c4sc.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : "زبانی که با آن صحبت می‌کنیم، می‌تواند تشخیص رنگ‌ها را برایمان آسان‌تر کند " ,
    "discription" : "طبق مطالعه‌ای جدید، زبانی که با آن حرف می‌زنیم کمک می‌کند تا تشخیص سایه‌ها و رنگ‌های مختلف برایمان ساده‌تر شود. " , 
    "time" : " " ,
    "img" : "/images/m2-c1s.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : " چرا رایج‌ترین عناصر جهان روی زمین کمیاب هستند؟" ,
    "discription" : "عنصرهای رایج جهان مثل هیدروژن و هلیوم به سختی روی زمین پیدا می‌شوند؛ اما علت این کمیابی چیست؟ " , 
    "time" : " " ,
    "img" : "/images/m2-c2scie.webp"
              
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : " معمای تکاملی خارهای گل رز" ,
    "discription" : " خارهای گل رز، این ساختارهای به ظاهر ساده، داستان تکاملی جذابی را در خود پنهان کرده‌اند که راهبردهای مبتکرانه‌ی طبیعت برای بقا را آشکار می‌کند." , 
    "time" : " " ,
    "img" : "/images/m2-c3sc.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : " آیا واقعا می‌توان دیوار چین را از فضا مشاهده کرد؟" ,
    "discription" : " رسانه‌ها در گزارش فضانوردان مبنی بر مشاهده دیوار بزرگ چین و سازه‌های دیگر اغراق می‌کنند، اما تأثیر انسان بر سیاره زمین از فضا کاملا مشهود است." , 
    "time" : " " ,
    "img" : "/images/m2-c4sc.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : "زبانی که با آن صحبت می‌کنیم، می‌تواند تشخیص رنگ‌ها را برایمان آسان‌تر کند " ,
    "discription" : "طبق مطالعه‌ای جدید، زبانی که با آن حرف می‌زنیم کمک می‌کند تا تشخیص سایه‌ها و رنگ‌های مختلف برایمان ساده‌تر شود. " , 
    "time" : " " ,
    "img" : "/images/m2-c1s.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : " چرا رایج‌ترین عناصر جهان روی زمین کمیاب هستند؟" ,
    "discription" : "عنصرهای رایج جهان مثل هیدروژن و هلیوم به سختی روی زمین پیدا می‌شوند؛ اما علت این کمیابی چیست؟ " , 
    "time" : " " ,
    "img" : "/images/m2-c2scie.webp"
              
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : " معمای تکاملی خارهای گل رز" ,
    "discription" : " خارهای گل رز، این ساختارهای به ظاهر ساده، داستان تکاملی جذابی را در خود پنهان کرده‌اند که راهبردهای مبتکرانه‌ی طبیعت برای بقا را آشکار می‌کند." , 
    "time" : " " ,
    "img" : "/images/m2-c3sc.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : " آیا واقعا می‌توان دیوار چین را از فضا مشاهده کرد؟" ,
    "discription" : " رسانه‌ها در گزارش فضانوردان مبنی بر مشاهده دیوار بزرگ چین و سازه‌های دیگر اغراق می‌کنند، اما تأثیر انسان بر سیاره زمین از فضا کاملا مشهود است." , 
    "time" : " " ,
    "img" : "/images/m2-c4sc.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : "زبانی که با آن صحبت می‌کنیم، می‌تواند تشخیص رنگ‌ها را برایمان آسان‌تر کند " ,
    "discription" : "طبق مطالعه‌ای جدید، زبانی که با آن حرف می‌زنیم کمک می‌کند تا تشخیص سایه‌ها و رنگ‌های مختلف برایمان ساده‌تر شود. " , 
    "time" : " " ,
    "img" : "/images/m2-c1s.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : " چرا رایج‌ترین عناصر جهان روی زمین کمیاب هستند؟" ,
    "discription" : "عنصرهای رایج جهان مثل هیدروژن و هلیوم به سختی روی زمین پیدا می‌شوند؛ اما علت این کمیابی چیست؟ " , 
    "time" : " " ,
    "img" : "/images/m2-c2scie.webp"
              
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : " معمای تکاملی خارهای گل رز" ,
    "discription" : " خارهای گل رز، این ساختارهای به ظاهر ساده، داستان تکاملی جذابی را در خود پنهان کرده‌اند که راهبردهای مبتکرانه‌ی طبیعت برای بقا را آشکار می‌کند." , 
    "time" : " " ,
    "img" : "/images/m2-c3sc.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : " آیا واقعا می‌توان دیوار چین را از فضا مشاهده کرد؟" ,
    "discription" : " رسانه‌ها در گزارش فضانوردان مبنی بر مشاهده دیوار بزرگ چین و سازه‌های دیگر اغراق می‌کنند، اما تأثیر انسان بر سیاره زمین از فضا کاملا مشهود است." , 
    "time" : " " ,
    "img" : "/images/m2-c4sc.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : "زبانی که با آن صحبت می‌کنیم، می‌تواند تشخیص رنگ‌ها را برایمان آسان‌تر کند " ,
    "discription" : "طبق مطالعه‌ای جدید، زبانی که با آن حرف می‌زنیم کمک می‌کند تا تشخیص سایه‌ها و رنگ‌های مختلف برایمان ساده‌تر شود. " , 
    "time" : " " ,
    "img" : "/images/m2-c1s.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : " چرا رایج‌ترین عناصر جهان روی زمین کمیاب هستند؟" ,
    "discription" : "عنصرهای رایج جهان مثل هیدروژن و هلیوم به سختی روی زمین پیدا می‌شوند؛ اما علت این کمیابی چیست؟ " , 
    "time" : " " ,
    "img" : "/images/m2-c2scie.webp"
              
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : " معمای تکاملی خارهای گل رز" ,
    "discription" : " خارهای گل رز، این ساختارهای به ظاهر ساده، داستان تکاملی جذابی را در خود پنهان کرده‌اند که راهبردهای مبتکرانه‌ی طبیعت برای بقا را آشکار می‌کند." , 
    "time" : " " ,
    "img" : "/images/m2-c3sc.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : " آیا واقعا می‌توان دیوار چین را از فضا مشاهده کرد؟" ,
    "discription" : " رسانه‌ها در گزارش فضانوردان مبنی بر مشاهده دیوار بزرگ چین و سازه‌های دیگر اغراق می‌کنند، اما تأثیر انسان بر سیاره زمین از فضا کاملا مشهود است." , 
    "time" : " " ,
    "img" : "/images/m2-c4sc.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : "زبانی که با آن صحبت می‌کنیم، می‌تواند تشخیص رنگ‌ها را برایمان آسان‌تر کند " ,
    "discription" : "طبق مطالعه‌ای جدید، زبانی که با آن حرف می‌زنیم کمک می‌کند تا تشخیص سایه‌ها و رنگ‌های مختلف برایمان ساده‌تر شود. " , 
    "time" : " " ,
    "img" : "/images/m2-c1s.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : " چرا رایج‌ترین عناصر جهان روی زمین کمیاب هستند؟" ,
    "discription" : "عنصرهای رایج جهان مثل هیدروژن و هلیوم به سختی روی زمین پیدا می‌شوند؛ اما علت این کمیابی چیست؟ " , 
    "time" : " " ,
    "img" : "/images/m2-c2scie.webp"
              
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : " معمای تکاملی خارهای گل رز" ,
    "discription" : " خارهای گل رز، این ساختارهای به ظاهر ساده، داستان تکاملی جذابی را در خود پنهان کرده‌اند که راهبردهای مبتکرانه‌ی طبیعت برای بقا را آشکار می‌کند." , 
    "time" : " " ,
    "img" : "/images/m2-c3sc.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Scie" , 
    "title" : " آیا واقعا می‌توان دیوار چین را از فضا مشاهده کرد؟" ,
    "discription" : " رسانه‌ها در گزارش فضانوردان مبنی بر مشاهده دیوار بزرگ چین و سازه‌های دیگر اغراق می‌کنند، اما تأثیر انسان بر سیاره زمین از فضا کاملا مشهود است." , 
    "time" : " " ,
    "img" : "/images/m2-c4sc.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : "چگونه برد رزبری پای را به هاب USB تبدیل کنیم؟ " ,
    "discription" : " یکی از کاربردهای برد رزبری پای، استفاده از آن به‌عنوان هاب USB برای اتصال دستگاه‌های مختلف و اشتراک آن‌ها از طریق LAN بین کامپیوترها است." , 
    "time" : " " ,
    "img" : "/images/m2-c1ed.webp"
            
  } ,

  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : " ۵ اشتباهی که منجر به کاهش عمر لپ‌تاپ می‌شوند" ,
    "discription" : "اگر دوست ندارید عمر لپ‌تاپتان کوتاه‌تر از آنچه باید شود، بهتر است از انجام برخی رفتارهای اشتباه خودداری کنید. " , 
    "time" : " " ,
    "img" : "/images/m2-c2edu.webp"
            
  } ,
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : "با بهترین میانبرهای کاربردی کیبورد در مک آشنا شوید " ,
    "discription" : " با استفاده از میان‌برهای کاربردی کیبورد در مک می‌توانید بهره‌وری خود را در کار با سیستم افزایش دهید و فرمان‌های خود را سریع‌تر به سیستم منتقل کنید." , 
    "time" : " " ,
    "img" : "/images/m2-c4ed.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : "چگونه برد رزبری پای را به هاب USB تبدیل کنیم؟ " ,
    "discription" : " یکی از کاربردهای برد رزبری پای، استفاده از آن به‌عنوان هاب USB برای اتصال دستگاه‌های مختلف و اشتراک آن‌ها از طریق LAN بین کامپیوترها است." , 
    "time" : " " ,
    "img" : "/images/m2-c1ed.webp"
            
  } ,

  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : " ۵ اشتباهی که منجر به کاهش عمر لپ‌تاپ می‌شوند" ,
    "discription" : "اگر دوست ندارید عمر لپ‌تاپتان کوتاه‌تر از آنچه باید شود، بهتر است از انجام برخی رفتارهای اشتباه خودداری کنید. " , 
    "time" : " " ,
    "img" : "/images/m2-c2edu.webp"
            
  } ,
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : "با بهترین میانبرهای کاربردی کیبورد در مک آشنا شوید " ,
    "discription" : " با استفاده از میان‌برهای کاربردی کیبورد در مک می‌توانید بهره‌وری خود را در کار با سیستم افزایش دهید و فرمان‌های خود را سریع‌تر به سیستم منتقل کنید." , 
    "time" : " " ,
    "img" : "/images/m2-c4ed.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : "چگونه برد رزبری پای را به هاب USB تبدیل کنیم؟ " ,
    "discription" : " یکی از کاربردهای برد رزبری پای، استفاده از آن به‌عنوان هاب USB برای اتصال دستگاه‌های مختلف و اشتراک آن‌ها از طریق LAN بین کامپیوترها است." , 
    "time" : " " ,
    "img" : "/images/m2-c1ed.webp"
            
  } ,

  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : " ۵ اشتباهی که منجر به کاهش عمر لپ‌تاپ می‌شوند" ,
    "discription" : "اگر دوست ندارید عمر لپ‌تاپتان کوتاه‌تر از آنچه باید شود، بهتر است از انجام برخی رفتارهای اشتباه خودداری کنید. " , 
    "time" : " " ,
    "img" : "/images/m2-c2edu.webp"
            
  } ,
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : "با بهترین میانبرهای کاربردی کیبورد در مک آشنا شوید " ,
    "discription" : " با استفاده از میان‌برهای کاربردی کیبورد در مک می‌توانید بهره‌وری خود را در کار با سیستم افزایش دهید و فرمان‌های خود را سریع‌تر به سیستم منتقل کنید." , 
    "time" : " " ,
    "img" : "/images/m2-c4ed.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : "چگونه برد رزبری پای را به هاب USB تبدیل کنیم؟ " ,
    "discription" : " یکی از کاربردهای برد رزبری پای، استفاده از آن به‌عنوان هاب USB برای اتصال دستگاه‌های مختلف و اشتراک آن‌ها از طریق LAN بین کامپیوترها است." , 
    "time" : " " ,
    "img" : "/images/m2-c1ed.webp"
            
  } ,

  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : " ۵ اشتباهی که منجر به کاهش عمر لپ‌تاپ می‌شوند" ,
    "discription" : "اگر دوست ندارید عمر لپ‌تاپتان کوتاه‌تر از آنچه باید شود، بهتر است از انجام برخی رفتارهای اشتباه خودداری کنید. " , 
    "time" : " " ,
    "img" : "/images/m2-c2edu.webp"
            
  } ,
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : "با بهترین میانبرهای کاربردی کیبورد در مک آشنا شوید " ,
    "discription" : " با استفاده از میان‌برهای کاربردی کیبورد در مک می‌توانید بهره‌وری خود را در کار با سیستم افزایش دهید و فرمان‌های خود را سریع‌تر به سیستم منتقل کنید." , 
    "time" : " " ,
    "img" : "/images/m2-c4ed.webp"
            
  } , 
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : "چگونه برد رزبری پای را به هاب USB تبدیل کنیم؟ " ,
    "discription" : " یکی از کاربردهای برد رزبری پای، استفاده از آن به‌عنوان هاب USB برای اتصال دستگاه‌های مختلف و اشتراک آن‌ها از طریق LAN بین کامپیوترها است." , 
    "time" : " " ,
    "img" : "/images/m2-c1ed.webp"
            
  } ,

  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : " ۵ اشتباهی که منجر به کاهش عمر لپ‌تاپ می‌شوند" ,
    "discription" : "اگر دوست ندارید عمر لپ‌تاپتان کوتاه‌تر از آنچه باید شود، بهتر است از انجام برخی رفتارهای اشتباه خودداری کنید. " , 
    "time" : " " ,
    "img" : "/images/m2-c2edu.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : "چگونه برد رزبری پای را به هاب USB تبدیل کنیم؟ " ,
    "discription" : " یکی از کاربردهای برد رزبری پای، استفاده از آن به‌عنوان هاب USB برای اتصال دستگاه‌های مختلف و اشتراک آن‌ها از طریق LAN بین کامپیوترها است." , 
    "time" : " " ,
    "img" : "/images/m2-c1ed.webp"
            
  } ,

  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : " ۵ اشتباهی که منجر به کاهش عمر لپ‌تاپ می‌شوند" ,
    "discription" : "اگر دوست ندارید عمر لپ‌تاپتان کوتاه‌تر از آنچه باید شود، بهتر است از انجام برخی رفتارهای اشتباه خودداری کنید. " , 
    "time" : " " ,
    "img" : "/images/m2-c2edu.webp"
            
  } ,
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : "با بهترین میانبرهای کاربردی کیبورد در مک آشنا شوید " ,
    "discription" : " با استفاده از میان‌برهای کاربردی کیبورد در مک می‌توانید بهره‌وری خود را در کار با سیستم افزایش دهید و فرمان‌های خود را سریع‌تر به سیستم منتقل کنید." , 
    "time" : " " ,
    "img" : "/images/m2-c4ed.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : "چگونه برد رزبری پای را به هاب USB تبدیل کنیم؟ " ,
    "discription" : " یکی از کاربردهای برد رزبری پای، استفاده از آن به‌عنوان هاب USB برای اتصال دستگاه‌های مختلف و اشتراک آن‌ها از طریق LAN بین کامپیوترها است." , 
    "time" : " " ,
    "img" : "/images/m2-c1ed.webp"
            
  } ,

  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : " ۵ اشتباهی که منجر به کاهش عمر لپ‌تاپ می‌شوند" ,
    "discription" : "اگر دوست ندارید عمر لپ‌تاپتان کوتاه‌تر از آنچه باید شود، بهتر است از انجام برخی رفتارهای اشتباه خودداری کنید. " , 
    "time" : " " ,
    "img" : "/images/m2-c2edu.webp"
            
  } ,
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : "با بهترین میانبرهای کاربردی کیبورد در مک آشنا شوید " ,
    "discription" : " با استفاده از میان‌برهای کاربردی کیبورد در مک می‌توانید بهره‌وری خود را در کار با سیستم افزایش دهید و فرمان‌های خود را سریع‌تر به سیستم منتقل کنید." , 
    "time" : " " ,
    "img" : "/images/m2-c4ed.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : "چگونه برد رزبری پای را به هاب USB تبدیل کنیم؟ " ,
    "discription" : " یکی از کاربردهای برد رزبری پای، استفاده از آن به‌عنوان هاب USB برای اتصال دستگاه‌های مختلف و اشتراک آن‌ها از طریق LAN بین کامپیوترها است." , 
    "time" : " " ,
    "img" : "/images/m2-c1ed.webp"
            
  } ,

  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : " ۵ اشتباهی که منجر به کاهش عمر لپ‌تاپ می‌شوند" ,
    "discription" : "اگر دوست ندارید عمر لپ‌تاپتان کوتاه‌تر از آنچه باید شود، بهتر است از انجام برخی رفتارهای اشتباه خودداری کنید. " , 
    "time" : " " ,
    "img" : "/images/m2-c2edu.webp"
            
  } ,
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : "با بهترین میانبرهای کاربردی کیبورد در مک آشنا شوید " ,
    "discription" : " با استفاده از میان‌برهای کاربردی کیبورد در مک می‌توانید بهره‌وری خود را در کار با سیستم افزایش دهید و فرمان‌های خود را سریع‌تر به سیستم منتقل کنید." , 
    "time" : " " ,
    "img" : "/images/m2-c4ed.webp"
            
  } ,
  
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : "چگونه برد رزبری پای را به هاب USB تبدیل کنیم؟ " ,
    "discription" : " یکی از کاربردهای برد رزبری پای، استفاده از آن به‌عنوان هاب USB برای اتصال دستگاه‌های مختلف و اشتراک آن‌ها از طریق LAN بین کامپیوترها است." , 
    "time" : " " ,
    "img" : "/images/m2-c1ed.webp"
            
  } ,

  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : " ۵ اشتباهی که منجر به کاهش عمر لپ‌تاپ می‌شوند" ,
    "discription" : "اگر دوست ندارید عمر لپ‌تاپتان کوتاه‌تر از آنچه باید شود، بهتر است از انجام برخی رفتارهای اشتباه خودداری کنید. " , 
    "time" : " " ,
    "img" : "/images/m2-c2edu.webp"
            
  } ,
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : "با بهترین میانبرهای کاربردی کیبورد در مک آشنا شوید " ,
    "discription" : " با استفاده از میان‌برهای کاربردی کیبورد در مک می‌توانید بهره‌وری خود را در کار با سیستم افزایش دهید و فرمان‌های خود را سریع‌تر به سیستم منتقل کنید." , 
    "time" : " " ,
    "img" : "/images/m2-c4ed.webp"
            
  } ,
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : "با بهترین میانبرهای کاربردی کیبورد در مک آشنا شوید " ,
    "discription" : " با استفاده از میان‌برهای کاربردی کیبورد در مک می‌توانید بهره‌وری خود را در کار با سیستم افزایش دهید و فرمان‌های خود را سریع‌تر به سیستم منتقل کنید." , 
    "time" : " " ,
    "img" : "/images/m2-c4ed.webp"
            
  } ,
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Hot love controversial mobail " , 
    "title" : "بهترین گوشی‌های موبایل بازار ایران [شهریور ۱۴۰۳] " ,
    "discription" : " با‌‌ توجه‌‌‌‌ به افزایش بی‌سابقه و افسارگسیخته‌ی قیمت گوشی‌ در چند سال گذشته در بازار ایران، این دستگاه مهم که بخش بزرگی از زندگی ما محسوب می‌شود، به کالایی لوکس تبدیل شده است" , 
    "time" : " " ,
    "img" : "/images/m2-c1.webp"
            
  } ,
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Shopping " , 
    "title" : "بهترین ماشین‌های لباسشویی ال‌جی در بازار ایران [شهریور ۱۴۰۳] " ,
    "discription" : " " , 
    "time" : " " ,
    "img" : "/images/m3-3.webp"
            
  } ,{
    "id" : 22 ,
    "hreft" : " " , 
    "category" : "controversial shopping love" , 
    "title" : "بهترین لپ‌تاپ‌های بازار ایران [مرداد ۱۴۰۳] " ,
    "discription" : " " , 
    "time" : " " ,
    "img" : "/images/m3-4.webp"
            
  } ,
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " controversial shopping" , 
    "title" : " بهترین گوشی های مناسب عکاسی در بازار ایران [مرداد ۱۴۰۳]" ,
    "discription" : " " , 
    "time" : " " ,
    "img" : "/images/m3-5.webp"
            
  } ,{
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " controversial " , 
    "title" : " پاول دوروف، بنیان‌گذار تلگرام در فرانسه دستگیر شد" ,
    "discription" : " " , 
    "time" : " " ,
    "img" : "/images/m3-6.webp"
            
  } ,
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate controversial love" , 
    "title" : " آموزش تغییر منطقه گوشی سامسونگ؛ دریافت سریع‌تر آپدیت‌ها و فعال‌‌ کردن ضبط مکالمه" ,
    "discription" : " " , 
    "time" : " " ,
    "img" : "/images/m3-7.webp"
            
  } ,{
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " iran controversial" , 
    "title" : "گزارش ماه جولای اسپیدتست؛ افت رتبه با وجود افزایش میانه سرعت اینترنت ثابت و همراه " ,
    "discription" : " " , 
    "time" : " " ,
    "img" : "/images/m3-8.webp"
            
  } ,
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " shopping " , 
    "title" : " بهترین یخچال فریزرهای بازار ایران [مرداد ۱۴۰۳]" ,
    "discription" : " " , 
    "time" : " " ,
    "img" : "/images/m3-9.webp"
            
  } ,{
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " shopping hard" , 
    "title" : " بهترین مانیتورهای گیمینگ بازار ایران [مرداد ۱۴۰۳]" ,
    "discription" : " " , 
    "time" : " " ,
    "img" : "/images/m3-10.webp"
            
  } ,
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " shopping" , 
    "title" : "بهترین مایکروویوهای ال‌جی [مرداد ۱۴۰۳] " ,
    "discription" : " " , 
    "time" : " " ,
    "img" : "/images/m3-11.webp"
            
  } ,{
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " love" , 
    "title" : " مشکلاتی که تکنولوژی پس از ۲۰ سال هنوز حل نکرده است" ,
    "discription" : " " , 
    "time" : " " ,
    "img" : "/images/m3-12.webp"
            
  } ,
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " love" , 
    "title" : "لوازمی با طراحی‌های جذاب که مردم را وادار به خرید کرده‌اند " ,
    "discription" : " " , 
    "time" : " " ,
    "img" : "/images/m3-13.webp"
            
  } ,{
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " love hard" , 
    "title" : "در سراشیبی سقوط؛ اینتل چگونه جایگاه برترش در صنعت تراشه را از دست داد؟ " ,
    "discription" : " " , 
    "time" : " " ,
    "img" : "/images/m3-14.webp"
            
  } ,
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : " " ,
    "discription" : " " , 
    "time" : " " ,
    "img" : "/images/m2-c1.webp"
            
  } ,{
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : " " ,
    "discription" : " " , 
    "time" : " " ,
    "img" : "/images/m2-c1.webp"
            
  } ,
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : " " ,
    "discription" : " " , 
    "time" : " " ,
    "img" : "/images/m2-c1.webp"
            
  } ,{
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : " " ,
    "discription" : " " , 
    "time" : " " ,
    "img" : "/images/m2-c1.webp"
            
  } ,
  {
    "id" : 22 ,
    "hreft" : " " , 
    "category" : " Educate" , 
    "title" : " " ,
    "discription" : " " , 
    "time" : " " ,
    "img" : "/images/m2-c1.webp"
            
  } ,
]
// display all of content   
displayContentItem(content)

// An array of buttons
const btns = document.querySelectorAll(".btn-m2");  

// filter of content  
btns.forEach( btn => {
  btn.addEventListener('click' , e => {
    btns.forEach(btn => {
      btn.classList.remove("active-btn");
    });
    e.target.classList.add("active-btn");
    const category = e.currentTarget.dataset.category;
    
    const categoryContent = content.filter(function(item){
      if (item.category.includes(category)){
        return item
      }
    });
    displayContentItem(categoryContent);
  })
})

//display of content  
function   displayContentItem(contentItems){
  let displayItem = contentItems.map(function(item){
    
    return  ` <div class="m2-con-item">
    <div class="m2-con-discription">
      <a href="">
        <h2> ${item.title} </h2>
      </a>
      <p>${item.discription}</p>
      <div>
        <div>
          <div class="m2-dis-icon1">
            <svg
              width="12"
              height="12"
              viewBox="0 0 16 16"
              xmlns="http://www.w3.org/2000/svg"
              stroke="#7d7d87"
              stroke-width="1.6"
              fill="#9696a0"
            >
              <path
                d="M8 .5c2.078 0 3.968.73 5.335 1.926C14.667 3.592 15.5 5.202 15.5 7c0 1.736-.812 3.267-2 4.389v3.853l-4.403-1.887c-.196.121-.481.142-.787.145H8c-2.078 0-3.968-.73-5.335-1.926C1.333 10.408.5 8.798.5 7s.833-3.408 2.165-4.574C4.032 1.23 5.922.5 8 .5z"
                fill="none"
                fill-rule="evenodd"
                fill-opacity="0"
              ></path>
            </svg>
            <span> 0</span>
          </div>
          <div class="m2-dis-icon2">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="12"
              height="12"
              viewBox="0 0 16 16"
              version="1.1"
              fill="#7d7d87"
            >
              <path
                d="M 15 2 L 13 2 L 13 0 L 10 0 L 10 2 L 6 2 L 6 0 L 3 0 L 3 2 L 1 2 C 0.449219 2 0 2.449219 0 3 L 0 15 C 0 15.550781 0.449219 16 1 16 L 15 16 C 15.550781 16 16 15.550781 16 15 L 16 3 C 16 2.449219 15.550781 2 15 2 Z M 14 14 L 2 14 L 2 5 L 14 5 Z M 14 14 "
              ></path>
            </svg>
            <span>یک ساعت پیش</span>
          </div>
          <div class="m2-dis-icon3 ">
            <div>
              <button type="button" class="share-item">
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  viewBox="0 0 16 16"
                  width="16"
                  height="16"
                  fill="#7d7d87"
                >
                  <g fill-rule="evenodd">
                    <g>
                      <path
                        d="M8 6c1.105 0 2 .895 2 2s-.895 2-2 2-2-.895-2-2 .895-2 2-2zM2 6c1.105 0 2 .895 2 2s-.895 2-2 2-2-.895-2-2 .895-2 2-2zm12 0c1.105 0 2 .895 2 2s-.895 2-2 2-2-.895-2-2 .895-2 2-2z"
                        transform="translate(-1356.000000, -1286.000000) translate(1356.000000, 1286.000000)"
                      ></path>
                    </g>
                  </g>
                </svg>
              </button>
            </div>
          </div>
        </div>
      </div>
    </div>
    <a href="" class="m2-con-img">
      <div class="m2-con-img-d">
        <img src="${item.img}" alt="" />
      </div>
    </a>
    </div>`
  });
  displayItem = displayItem.join('');
  document.querySelector(".m2-con-items").innerHTML = displayItem ;
}

// search-box 
const search = document.getElementById("search-inputt");
const showItems = document.querySelector("#showItems");
const showCategory = document.querySelector("#showCategory");

let tbody = document.querySelector("tbody");
let td = document.createElement("td");
let search_term = "";
let count = 0;

const showList = () => {
  showItems.innerHTML = "";
  count = 0;
  content.filter((item) => {
    return (
      // item.category.toLowerCase().includes(search_term) ||
      item.title.toLowerCase().includes(search_term)
    );

  }).forEach((e) => {
    count += 1;
    // showCategory.innerHTML = `${e.category}`
    document.querySelector(".search-items-results").style.display = "block";
    document.querySelector(".search-title2").style.display = "block";
    document.querySelector(".search-title1").style.display = "none";
    document.querySelector(".search-default").style.display = "none";

    showItems.innerHTML += `<li>
      <div class="intro-1-2-col li-icon">
        <div class="icon-square"></div>
      </div>
      <div class="intro-1-2-col li-text">
      <a href="">${e.title} </a>
      </div>
    </li> `
  });

};
search.addEventListener("keyup", (event) => {
  document.querySelector(".search-item-null").style.display = "none";
  event.preventDefault();
  if(search){
    td.innerHTML = "";
    search_term = event.target.value.toLowerCase();
    td.innerHTML = showList();
    console.log(count);
    // Check Count
    if (count === 0) {
      document.querySelector(".search-item-null").style.display = "block";
      document.querySelector(".search-title1").style.display = "none";
      document.querySelector(".search-default").style.display = "none";
      document.querySelector(".search-title2").style.display = "none";

    } else if(count === 135) {
      document.querySelector(".search-items-results").style.display = "none";
      document.querySelector(".search-title2").style.display = "none";
      document.querySelector(".search-title1").style.display = "block";
      document.querySelector(".search-default").style.display = "block";
    } else {
      td.innerHTML = showList();
    }
  }    
});


//display of filtercontent  
function displayfilter(contentItems){
  let displayItem = contentItems.map(function(item){         
    return  `<ul>
    <li>
      <div class="intro-1-2-col li-icon">
        <div class="icon-square"></div>
      </div>
      <div class="intro-1-2-col li-text">
      ${item.title}
      </div>
    </li>      
    </ul>`
  });
  count+=1;
  // console.log(counter)
  displayItem = displayItem.join('');
  document.querySelector(".search-items").innerHTML = displayItem ;
  // console.log(displayItem);
}

// popup for zoomit icon

let popupBtns = document.querySelectorAll("button.popup-btn")
  if (popupBtns) {
  var popupwrapper = document.createElement("div");
  popupwrapper.className = "popup-wrapper";
  document.body.prepend(popupwrapper);
}
popupBtns.forEach(popupBtn => {
      popupBtn.addEventListener("click" , e => {
    let popup = popupBtn.nextElementSibling
    popup.classList.add("show")
    popupwrapper.classList.add("show")
    
    let searchbox = document.querySelector(".search-box");
    searchbox.classList.remove("display-search");
    // popupwrappersharing.classList.remove("show");

    e.preventDefault();

    let popupclosesfunc = e => { 
      popup.classList.remove("show");
      popupwrapper.classList.remove("show");
      e.preventDefault();
    }
    
    let popupcloses = document.querySelectorAll(".popup-close")
    popupcloses.forEach(popupcloses => {
      popupcloses.addEventListener("click" , popupclosesfunc)
    })
    popupwrapper.addEventListener("click" , popupclosesfunc)
  })
});


//search 
var btnsearch = document.querySelector(".btn-search");
btnsearch.addEventListener('click' , function(e) {
  let popupwrappersharing = document.createElement("div");
  popupwrappersharing.className = "popup-wrapper-sharing";
  document.body.prepend(popupwrappersharing);
  
  let searchbox = document.querySelector(".search-box");
  popupwrappersharing.classList.add("show");
  searchbox.classList.remove("fade");
  searchbox.classList.add("display-search");
  document.getElementById("navbar-link").classList.add("navbar-link-scroll");
  document.getElementById("navbar-link").classList.remove("navbar-link");


  e.preventDefault();
  let btnsearchclosefunc = e => { 
    searchbox.classList.remove("display-search");
    searchbox.classList.add("fade");
    popupwrappersharing.classList.remove("show");
    
    document.getElementById("navbar-link").classList.remove("navbar-link-scroll");
    document.getElementById("navbar-link").classList.add("navbar-link");
    e.preventDefault()
  }
  popupwrappersharing.addEventListener("click" , btnsearchclosefunc);
  window.onscroll = btnsearchclosefunc ;

})

// Show text news in m1 

let textnewsBtns = document.querySelector(".textnews");
textnewsBtns.addEventListener("click" , e => {
  
  var body = document.getElementById("body");
  
  if (body.className == "dark-mode"){
    document.querySelector(".textnews").style.backgroundColor='#32323c';
    document.querySelector(".textnews").style.color='#ffffff'; 
    document.querySelector(".textnews").style.border='none'; 
    // document.querySelector(".textnews").classList.add("active-dark-textnews");

    document.querySelector(".videos").style.border='solid 1px #45454e';
    document.querySelector(".videos").style.color='#ffffff';
    document.querySelector(".videos").style.backgroundColor='transparent';
    // document.querySelector(".videos").classList.remove("active-dark-videos");

  } else {
    document.querySelector(".textnews").style.backgroundColor='#32323c';
    document.querySelector(".textnews").style.color='#ffffff'; 
    // document.querySelector(".textnews").classList.add("active-btn");

    document.querySelector(".videos").style.backgroundColor='transparent';
    document.querySelector(".videos").style.color='#32323c'; 
    // document.querySelector(".videos").classList.remove("active-btn");

  }
  
  var i, video , textnew ;
  textnew = document.getElementsByClassName("textnew1");
  for (i = 0; i < textnew.length; i++) {
    textnew[i].style.display = "inline-block";
  }
  video = document.getElementsByClassName("video");
  for (i = 0; i < video.length; i++) {
    video[i].style.display = "none"; 
  }
});



// Show video in m1 

let videosBtns = document.querySelector(".videos");
videosBtns.addEventListener("click" , e => {
  var body = document.getElementById("body");
  
  if (body.className == "dark-mode"){
    document.querySelector(".videos").style.backgroundColor='#32323c';
    document.querySelector(".videos").style.color='#ffffff'; 
    document.querySelector(".videos").style.border='none'; 
    // document.querySelector(".videos").classList.add("active-dark-videos");


    document.querySelector(".textnews").style.border='solid 1px #45454e';
    document.querySelector(".textnews").style.color='#ffffff';
    document.querySelector(".textnews").style.backgroundColor='transparent';
    // document.querySelector(".textnews").classList.remove("active-dark-textnews");

  
  } else {
    document.querySelector(".textnews").style.backgroundColor='transparent';
    document.querySelector(".textnews").style.color='#32323c';
    // document.querySelector(".textnews").classList.remove("active-btn");

    document.querySelector(".videos").style.backgroundColor='#32323c';
    document.querySelector(".videos").style.color='#ffffff';
    // document.querySelector(".videos").classList.add("active-btn");

  }
  var i, video , textnew ;
  textnew = document.getElementsByClassName("textnew1");
  for (i = 0; i < textnew.length; i++) {
    textnew[i].style.display = "none";
  }
  video = document.getElementsByClassName("video");
  for (i = 0; i < video.length; i++) {
    video[i].style.display = "inline-block";
    
  }
});



//Bookmark and sharing

// let popupsharingBtns = document.querySelectorAll(".share-item")
//   if (popupsharingBtns) {
//   var popupwrappersharing = document.createElement("div");
//   popupwrappersharing.className = "popup-wrapper-sharing";
//   document.body.prepend(popupwrappersharing);
// }
// var mousePos = {}
// popupsharingBtns.forEach(popupsharingBtn => {
  
//   popupsharingBtn.addEventListener("click" , e => {
//     var rect = e.target.getBoundingClientRect(); // get some poition, scale,... properties of the item
//     mousePos.x = e.clientX + rect.left; // get the mouse position relative to the element
//     mousePos.y = e.clientY + rect.top;
//     let popupsharing = document.querySelector(".popup-sharing")
//     popupsharing.classList.add("show")
//     popupsharing.style.left = mousePos.x + "px"; // set the modal position to the last stored position
//     popupsharing.style.top = mousePos.y + "px";
    
//     popupwrappersharing.classList.add("show")
//     e.preventDefault()


//     let popupclosesfunc = e => { 
//       popupsharing.classList.remove("show")
//       popupwrappersharing.classList.remove("show")
//       e.preventDefault()
//     }
    
//     // let popupcloses = document.querySelectorAll(".popup-close")
//     // popupcloses.forEach(popupcloses => {
//     //   popupcloses.addEventListener("click" , popupclosesfunc)
//     // })
//     popupwrappersharing.addEventListener("click" , popupclosesfunc)
//   })
// });


// let sharebtn = document.querySelectorAll(".share-item");

// sharebtn.forEach(function(btn){
    
//   btn.addEventListener('click' , function(e){
//   let output =  `
//     <div>
//     <ul>
//     <li> </li>
//     <li>اشتراک گذاری</li>
//     </ul>
//     </div>
//   `;
    
//   document.querySelector(".m2-dis-icon3").innerHTML = output ;

//   });
  

// });


//show content in m3

// Default active button
document.querySelector(".Hot").classList.add("active-btn")
// An array of buttons
const m3btns = document.querySelectorAll(".btn-m3");  

// filter of content  
m3btns.forEach( btn => {
  btn.addEventListener('click' , e => {
    m3btns.forEach(btn => {
      btn.classList.remove("active-btn");
    });
    e.target.classList.add("active-btn");
    const category = e.currentTarget.dataset.category;
    console.log(category);
    const categoryContent = content.filter(function(item){
      if (item.category.includes(category)){

        return item
      }
    });
    displayM3Item(categoryContent);
  })
})

//display of content  
function   displayM3Item(contentItems){
  let displayItem = contentItems.map(function(item){
    
    return  `<div class="m3-slide">
    <div class="m1-slide-image">
      <a href="">
        <img src="${item.img}" alt="" />
      </a>
    </div>
    <div class="m1-slide-content">
      <a href="">
        <h3>${item.title}     </h3>
      </a>
    </div>
    <div class="m1-slide-content2">
      <div class="coment">
        <a href="">
          <svg
            width="12"
            height="12"
            viewBox="0 0 16 16"
            xmlns="http://www.w3.org/2000/svg"
            stroke="grey"
            stroke-width="1.7"
            fill="#9696a0"
          >
            <path
              d="M8 .5c2.078 0 3.968.73 
                            5.335 1.926C14.667 3.592 15.5 5.202 15.5 7c0 1.736-.812 3.267-2 
                            4.389v3.853l-4.403-1.887c-.196.121-.481.142-.787.145H8c-2.078 0-3.968-.73-5.335-1.926C1.333 
                            10.408.5 8.798.5 7s.833-3.408 2.165-4.574C4.032 1.23 5.922.5 8 .5z"
              fill="none"
              fill-rule="evenodd"
              fill-opacity="0"
            ></path>
          </svg>
          <span>12</span>
        </a>
      </div>
      <div class="time">
        <a href="">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="12"
            height="12"
            viewBox="0 0 16 16"
            version="1.1"
            fill="#7d7d87"
          >
            <path
              d="M 15 2 L 13 2 L 13 0 L 10 0 L 10 2 L 6 2 L 6 0 L 3 0 L 3 2 L 1 2 C 0.449219 2 0 2.449219 0 3 L 0 15 C 0 
                                15.550781 0.449219 16 1 16 L 15 16 C 15.550781 16 16 15.550781 16 15 L 16 3 C 16 2.449219 15.550781 2 15 2 Z M 14 
                                14 L 2 14 L 2 5 L 14 5 Z M 14 14 "
            ></path>
          </svg>
          <span>2 ساعت پیش</span>
        </a>
      </div>
      <div class="more-info">
        <button
          type="button"
          class="icon-button"
        >
          <svg
            xmlns="http://www.w3.org/2000/svg"
            viewBox="0 0 16 16"
            width="16"
            height="16"
            fill="#afafb6"
          >
            <g fill-rule="evenodd">
              <g>
                <path
                  d="M8 6c1.105 0 
                                2 .895 2 2s-.895 2-2 2-2-.895-2-2 .895-2 2-2zM2 6c1.105 0 2 .895 2 2s-.895 2-2 2-2-.895-2-2 .895-2 2-2zm12
                                0c1.105 0 2 .895 2 2s-.895 2-2 2-2-.895-2-2 .895-2 2-2z"
                  transform="translate(-1356.000000, -1286.000000)
                                translate(1356.000000, 1286.000000)"
                ></path>
              </g>
            </g>
          </svg>
        </button>
      </div>
    </div>
  </div>`
  });
  displayItem = displayItem.join('');
  document.querySelector(".m3-slides").innerHTML = displayItem ;
}

//show content in m4

// An array of buttons
const m4btns = document.querySelectorAll(".btn-m4");  

// filter of content  
m4btns.forEach( btn => {
  btn.addEventListener('click' , e => {
    m4btns.forEach(btn => {
      btn.classList.remove("active-btn");
    });
    e.target.classList.add("active-btn");

    var category = e.currentTarget.dataset.category;
    const categoryContent = content.filter(function(item){
      if (item.category.includes(category)){

        return item
      }
    });
    displayM4Item(categoryContent);
  })
})

// Default active button

document.querySelector(".mobail").classList.add("active-btn");

//display of content  
function   displayM4Item(contentItems){
  let displayItem = contentItems.map(function(item){
    
    return  `<div class="m2-slide height-190 ml-16 position-relative">
    <a href="">
      <article class="img1-p-m2">
        <div class="img1-p2-k img-p2-m2 position-absolute">
          <p>${item.title}</p>
        </div>
        <div class="img1-icon2 position-absolute">
          <div class="m2-time-icon2">
            <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 16 16" width="12" height="12" fill="#ffffff">
              <path d="M8 0c4.4 0 8 3.6 8 8s-3.6 8-8 8-8-3.6-8-8 3.6-8 8-8zm0 2C4.7 2 2 4.7 2 8s2.7 6 6 6 6-2.7 6-6-2.7-6-6-6zm1 2v3h3v2H7V4h2z" transform="translate(-844 -1035) translate(844 1035)"></path>
            </svg>
            <span>مطالعه 6</span>
          </div>
          <div class="m2-dis-icon2 m2-dis2-fl">
            <svg xmlns="http://www.w3.org/2000/svg" width="12" height="12" viewBox="0 0 16 16" version="1.1" fill="#ffffff">
              <path d="M 15 2 L 13 2 L 13 0 L 10 0 L 10 2 L 6 2 L 6 0 L 3 0 L 3 2 L 1 2 C 0.449219 
                                2 0 2.449219 0 3 L 0 15 C 0 15.550781 0.449219 16 1 16 L 15 16 C 15.550781 16 16 
                                15.550781 16 15 L 16 3 C 16 2.449219 15.550781 2 15 2 Z M 14 14 L 2 14 L 2 5 L 14 5 Z M 14 14 "></path>
            </svg>
            <span>یک ساعت پیش</span>
          </div>
        </div>
      </article>
      <div class="m2-item3-img1 big-img position-absolute clear-fix">
        <img class="m2-img1" src="${item.img}" alt="">
      </div>
    </a>
  </div>`
  });
  displayItem = displayItem.join('');
  document.querySelector(".m4-slides").innerHTML = displayItem ;
}










